cases/dambreaktest_HRD/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
/*    atm
    {   
        type            fixedValue;
        value           uniform (0 0 0);
    }
*/
    atm
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

/*
    atm
    {
	type 		inletOutlet;
	inletValue	uniform (0 0 0);
	value		uniform (0 0 0);   
    }
*/
    floor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
