cases/dambreaktest_HRD/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue p_rgh 1e5
    volScalarFieldValue p 1e5
    volScalarFieldValue T 293.15
);

regions
(
    boxToCell
    {
        box (-10 -10 -1) (20 10 0.03);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue T 1400
        );
    }
);


// ************************************************************************* //
